import { Injectable } from '@angular/core';
import { InMemoryDbService} from "angular-in-memory-web-api";
import {Hero} from "./hero";

@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService{

  powers = ['BIG BRAIN', 'X-ray vision(cannot be turned off)',
    'Sexy', 'Mega cum blast', 'Inverse nose', 'Ð̸̨̛̲̠͉͍͙͍̟̩͙͎̻͚̞̤͚͙̙̯̘͇͔͕̝͓̥̭̫̫̼̟͕̖͙̲͍̲̼̞̺̙̲͙̟͖̤̘͖̥̯͕̱̼͑͒̍̀̔͗͂̋́̂̐̾̎̌̑͋͛͆̑͒͛̔̈́̈́̏̓̓̌̈͑̋͑̄̈͂̉̋̃̇̈́͆̽̂̐̂͛͋̚̕̕̕͜͜͠͝ͅͅĘ̶̡̨̧̨̨̨̢̧̡̨̖͍̥̹͔̝̣̹̜͉̩̼̞͔͙̟̳͓̪̝̹̫̥͇̱̜͈̩̣̣̲̬̜͇̖̭̖͉̥̥̣̠͍͎̬͙̱͍̩͍̮͉̼̗͔̺̱̬̻̳̺͕̝͔̝̙̫̣̣̭͚͚̀͛͜͜͜͜͜ͅͅÄ̶̧̨̧̧̧̧̧̢̡̧̠͉̦̲̘̰̬̲̳͕̪̫̬̖̦̜̥͔͓̙̦̼͙̮̗̣̳͍͖̱̗͖̰̥͓̮̖̥̥͖̙̻̟̖͈͕̙̣̫̩̰̝͖͖͈͙͇͚͙̞͚̲̬͈̼̝͙̩̖͉̙̱͍̫̖̥̜̠̲̥̤̻̝̺̖̬̰̭̽̃̊̌̌͌̓̽̽̏̈́̀̐̃̄͑̀̈̄̏̎̑̏̑̾̍́͊̚̚̚͝ͅͅŖ̵̧̡̨̨̧̛̰̼̩͍̦̹̩̭̖̣̳̦̯̞͎̗̮͚̙̞͙̰̞̻͎̰̱̝̣͍̣̲̝̦͙̯̳̭͖̜̜͕̱̰̺̟͚̣̮͕͉̣̼̣̩̯̖̘̝̖̌̌̊̈́͗̽̃̂̓̍̈́̈̂̍̈́̐̓̔̐͊̎̈́̈́́̒͛́́͐͛̑̏̑͛̎̈́̍̋̇̃͋̇̅̍͒͜͜͠͝͝͝ͅ ̷̢̡̢̧̡̢̢̨̡̫̥̞͉̪̞͍̥͚̹̙͈̙̼̩͍͙͖͉̰͖̤̰̗̗̣͎̭͇̹̜͍̘͍͙̮̺͕̩͓̠̜͇̠̩̜̠̘̠̟̳͔̗̮͕͙̬̖͕̘̰̩̫̪̭̼͎̣̯̮́͐͒͆̊̃̊̂̎͑̏̍͒͋̓̔̍͂̇́́̇̈́͛͊͛̆̔̄̎̈́͌̉̈̏͗̉̾͌͌͗̈̉͐̈̐̄͗̏̌͘̕̕͜͜͜͜͠͝͝͝͠͠͠Ģ̶̡̧̨̡̨̨̨̡̛͖̦̙͖̞̲̜̘͕͓͚̣̮̹̘̩͕̱̱̰̦͕̺̦͖͙͍̮̜͈̮̰͇̲̮͕̲͙̟̠̦̯͕̥̫̝̭̭̥̭̳͕͈̰̳̮̝̋͂͑͊̃̉̾̈̌̈́́̇̅̏͋̽̓̈͗̀̈́͊̽̇́̾͒̅̃̕̚̚͜͠͠͠͠ͅͅͅƠ̴̧̡̨̝̻͔̗̦̟͎͇̣̳͇̲̣̳͍̞̦̘͔̤͕̟̝̪̝̙̙͕͕̪̺̦͙̙̭͔̼̩͙̼͍̟͍͕̣͕̞̤̟̞͓̹̮̯̩̯͉͔͙̗̗͓̼̹͔͈̬͈͍̞̻͈͔̻̈͆̍̅̽̈́̈́̄̈̔͂̐̄̀̋̓̔̔̌̂́̊͒̊̍͌̊͌̿́̀͌̾̂̊̓͂̆̀̂̀̀̊͑̍̆̉͋̆̕̚̕͜͜͝͠͝͝͝ͅÐ̴̧̢̝̬̹͖̖̤̞͉͐͘̕ ̷̧̢̧̛̛̛͈̗͙̗̮͇̘̻̠̘̝̩̭̟̘̹͚͎͎͍͕̞̯̝͈̺͚̣̠̟̥̙̠͚͕̠̞̗̈̽͗͂͑͆̎͌̇̄̒̽͐̇̈́̍̆̽͂̄͆͗̒̔̈́͒̈́́̍͗͋̃̉̿̈́́̌̈͐͗͐̄̽̿́͋͐̑͒͑́̐̈́͋̋̔̔̓̍͆͌̐͛̀͐͒̌̾͌́̐̌̀͑̂̏̀͒͂̐̿̚͘͘͘͘͝͝͝͝͝͝þ̵̧̛̟͉̩̘̥̖͚͎̻̗̜̝̙̰̪̭̳͍̘̩̜̠͇̙͇̮͇͕͗̄́̑͐̓̅̈͛͊̾̑̓͆͗͊̄̽̐̔̾̇̈́͌̈́̌̅̏̐̔͋̀̋̔͌̓̏̽̊̅̎͑̀̏̏́̈̔̆̈́̽̓̿̅̀̒̔́̂̉͒̈͗̀̀̑̽̿͛͑̏͊̑͘̕͘͘͘͘͝͝͝͠͝͝ͅL̸̡̢̨̡̨̨̧̢̡̫͎̜̖͕̣̤̞̬̠̝̥͎̞̙̬̟͍̺͚͈͎̬̦̤̱̺͚͇̬̙̮̞̗̱̗̪̲̪͙͕͍̤̬̮̹̳̙̟̬̝̭͕̭͓̰̬̜̜̟̤̤̰̫̟̫͚͈̭̬̰͎̔̉̇̄̈́̈́̃̍̎͊̾̃͗̆͐̑͂͌̀̈́̀̋̿̿͗̃̓́͂͑̂͒̽̾̅͑͆͒́͛̍̃̎̀͒̽̑̉̎̿̌̊̂̉̀̍̍̆͊͐̓̀͗͌̔͆̃̌̽̿̈́̂͘̕͘̕͘̚͝͠͝͠ͅĘ̷̨̧̢̛͇̗͓̞͕̠̝͇̖͖̼͎̝̼̝̻̟̝͈͔͓̬͚̜̜̭͈̪̗͔̥̪͚̖̺̞̝̠̜̘̭̹͓͇̀͋͗̈́̓͋̃̆͂̾͂̊͒̌̅̌̄͋̃͋̏̈́̒̒̾̂̓͑͛̂͛̓͒̀̈́̌̏̄̋͋̓̑̈́̇̔͊͂̋̒͋͒͗̚̕̚̚̚̕̕̚͜͜͜͝͝͝͠ͅÄ̸̡̡̡̧̨̛̛̭̬̣̩̦̙̬̩̜̬̹͇͎̦̳̲̘̼͉̫̜͇̰̞̟̥̟͍͇̘͕̬͉̟͎̝̝͉̣̳͉̗̗̺̘͖̀̓͋̽̔͛̽͆͋͆͌̀͂̃̂̇͆̓̓͆̀̇̒̄̎̍͒̈͑͆̾͌͆̈̅̚͝͝§̴̧̨̡̜̥̼̻̠̙͈̺̝̠̦̪̟̻̺̭͉͈̪̝̮̻͍̖̹͈̬͈͇̺̝̼͙̯̲̞͖̺͇͎̳͔̙͙͖͎͙̼̳͖͍̊̓̄̿̾̽̈́̐̒͗͂̔̎͑̏̾̈̂̅̒̋͊̐̐̾̑͗̇̽̉͆̎̀͊͛̂͛̉̌̿̐̌̌̚̕͘͜͜͜͜͠͝͠͠È̸̢̢̧̧̧̧̡̡̧̧̛̬̜̲̦̳̹̥͇͈̬̠̱̬̘͇̪͕̳̬̥̼̗̹͓͓̙͚̲̬̝͓͉͓̙̹̖̯͙̜̻͇̗̲̯̜̤͙͕͓͓̜̠͓̘̙̼͎̯͎̝͇̪̫̖͍̳̼̦͍͕̆̊̍̃̅̌̓͆͂͒̽̄͂̈̓̽̌̋͛̓̈́͆͂̍̒͂͐̂͂̇̀̓̑͊̔́̃̔͆͐̆̏̅̆̈́͌͂͑̓̐̽̋̀͒͑̈́̈́̐̔̅̈́͊͊͗͋̿̽͒̑̂̃̈́̏̂͂̐̃̇̓͑̾̕̕̕͘͜͝͝͝ͅͅͅ ̶̡̡̨̡̡̧̢̡̛̛̻̪̥̟̺̹̬̲͖͖̳͖̲͙̮͙͓͓̲̗͙̪̞̯̫̯͖͎̯͕̟͙̹͙̱͎̫͇͓̹̖͔͇̳̥̭̙̼̪̬̪̰͎̦̫̻̱̮͙̟̎̂̓̋̀̈́̃̑̑̋̈̊̈́́̔̈́́͊͒͛̊̊͋́̊̎͋̅̆̅̅̃̚͘͜͜H̸̛̛̛̘̙̩̙̯́̂́̾͐͌̏̈͆̏̊͆͗͗̓̄̐̑̐̂̆̅̀̍͊̽͗͐̊̊́͒̈́̽́̊̍̓̄̈̐̓̅̓̐͑̿̿́̆̏͆̑̀̏̃̔͑̑̏̆̑̇͗̅͑̈́̓̓͌̃̈́̊͛̅́̐̏͛͐̕̚̕̕̚̚̕̚͝͝͝͠͠͝͝͠È̸̡̢̢̢̡̡̛̤̖̦̦̥͕̳̰̖̦̘̣͈̫̤̮̻̲͚̞̲̟̝̫̜̗̣̫̳̫͎͓͖͙͉͍̪̩̲͎̤̳̖̖͇̪̩͓̮͍̬͎̮̪̱̝̲̰͕̻͓̠̭̗͇̺̝͎̝̥̲̦̺̖͈̣̭̪͆̎͂̑͆̽̄̓̐͗̑̄̑̆̐̇̓̚̚̕͜͜͜͜͜͜͝ͅͅͅL̷̡̡̧̧̛̛̺͓̳͙̮͉͔͖̤̤̞͍͎͕̯̠̼̱͎̼̤͍͔̦̩̜̭̝̦̥͍̝͕̻͚͔̯̖̣͓̤͓̮̂͋̊̂̈́͋̈̉̍͌͛̍̓̽͐̈́̔̒̾͒̄͐̍̏̇̀̐̅́̇͐̈̚͘͜͝͝͝ͅþ̸̡̧̨̧̨̧̡̧̛͓̲̯̳͕͕͉̝̗̜̬̥͎̰̤͓̬̦͕̹̺̳̮͉̯̮͙̝̱̹̦̹̺͉̜̱͓͓̦̬͖̰͓̤̭̱̦̭͓̐͑̎͆̃͋̈͋͆̓͑̏̈́̐̾̓̈́̀̑̎͒̓̂͂̒̅͊̈͒͗̃̑̾̀͆̍̾̓͋̀̑̽̆̊̀͗̍̓́͒̎̉̌̉̿̓̏̅̎̌̏̓̿̇͘̕̕̚͘̕͜͝͝͝͝͝͝͝͝͝ͅͅͅ']

  createDb() {
    const heroes: Hero[] = [
      {id: 1, name: "Gay Bowser", power: this.powers[3], alterEgo: 'Mario'},
      {id: 2, name: "Proboscis Monkey", power: this.powers[0], alterEgo: 'Pro Monkey'},
      {id: 3, name: "ḩ̶̦͕͍͐̎̃͘ê̶̻͖̯͗́͌͐ͅl̸̨̜̪̺̈́͊̎̆þ̸̙̥̭̯͑̈́̽͑ ̵̘͈̼͉̒̓͑̕m̸̨͈̺̈̓͂̾ͅḙ̸̪͉̺̂̀̽̈̑",
      power: this.powers[5], alterEgo: 'you'},
      {id: 4, name: "President Obama", power: this.powers[2], alterEgo: 'Unknown'},
      {id: 5, name: "Rubber Duck", power: this.powers[1], alterEgo: 'Dildo'},
      {id: 6, name: "8===D", power: this.powers[3], alterEgo: ':)'},
      {id: 7, name: "Bannan Man", power: this.powers[3],
        alterEgo: 'Banana(not a man}'},
      {id: 8, name: "Chair", power: this.powers[0], alterEgo: 'Toilet'},
      {id: 9, name: "Twink", power: this.powers[2], alterEgo: 'Pinocchio'},
      {id: 10, name: "Pinoctio", power: this.powers[4], alterEgo: 'Pinocchio'}
          ]
    //dad if you read this you are gay
    return {heroes};
  }
genId(heroes: Hero[]): number {
    return heroes.length > 0?
      Math.max(...heroes.map(hero => hero.id ? hero.id : 0)) + 1 : 1;
}



  constructor() { }
}
